biddr_api/biddr_api/app/controllers/api/application_controller.rb

    def current_user
        if session[:user_id]
            @current_user ||= User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 121], ["LIMIT", 1]]