biddr_api/biddr_api/app/controllers/api/v1/auctions_controller.rb

    def index
        auctions= Auction.all
---
SELECT "auctions".* FROM "auctions"

    def create
        auction = Auction.new auction_params
        if auction.save
---
INSERT INTO "auctions" ("title", "description", "price", "ends_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
        auction = Auction.find(params[:id])
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]