biddr_api/biddr_api/app/controllers/api/v1/bids_controller.rb

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def set_auction
        @auction = Auction.find(params[:auction_id])

SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  [["auction_id", 18]]
---
    def set_course
        @bid = @auction.bids.find_by!(id: params[:id])